auth/app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def current_account
    if doorkeeper_token
      Account.find(doorkeeper_token.resource_owner_id)