auth/app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts"
---
  def index
    @accounts = Account.all

UPDATE "accounts" SET "role" = $1, "updated_at" = $2 WHERE "accounts"."id" = $3  [["role", nil], ["updated_at", "2022-10-08 23:13:38.487236"], ["id", 3]]
---
  def update
    respond_to do |format|
      new_role = @account.role != account_params[:role] ? account_params[:role] : nil

      if @account.update(account_params)

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_account
    @account = Account.find(params[:id])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_account
    if doorkeeper_token
      Account.find(doorkeeper_token.resource_owner_id)